# Lesson 1
# Наберите в редакторе код из задания символ в символ и нажмите «Проверить».

print('Hello, World!')

# Lesson 2
# Создайте однострочный комментарий с текстом: You know nothing, Jon Snow!

# You know nothing, Jon Snow!

# Lesson 3
# Выведите на экран друг за другом три имени: Robert, Stannis, Renly.
# Для каждого имени используйте свой собственный вызов print().

print('Robert')
print('Stannis')
print('Renly')

# Lesson 4
# Выведите на экран 9780262531962.

print(9780262531962)

# Lesson 5
# Выведите на экран: What Is Dead May Never Die

print('What Is Dead May Never Die')
