# Lesson 26
# Выведите на экран строку Do you want to eat, <name>?. Где вместо <name> должна использоваться переменная stark.
# Вывод должен получиться таким:
# Do you want to eat, Arya?

stark = 'Arya'
print(f'Do you want to eat, {stark}?')

# Lesson 27
# Выведите на экран последний символ строки, находящейся в переменной name

name = 'Na\nharis'
print(name[7])

# Lesson 28
# В переменной value лежит значение Hexlet. Извлеките из него и выведите на экран срез, который получит подстроку xle.
# Это задание можно сделать разными способами.

value = 'Hexlet'
print(value[2:5])

# Lesson 29
# Запишите в переменную text текст, который приведен ниже. Используйте тройные кавычки.

text = '''Lannister, Targaryen, Baratheon, Stark, Tyrell...
they're all just spokes on a wheel.
This one's on top, then that one's on top, and on and on it spins,
crushing those on the ground.'''

# Lesson 30
# Выведите на экран число -0.304.

print(-0.304)
