# Lesson 11
# Вычислите и выведите на экран произведение двух чисел: 0.39 и 0.22

print(0.39 * 0.22)

# Lesson 12
# Выведите на экран результат следующего вычисления:
# «разница между пятью в квадрате и произведением трёх и семи».
# Напишите код так, чтобы каждый оператор отделялся от операндов пробелами.

print(5 ** 2 - 3 * 7)

# Lesson 13
# Напишите программу, которая выведет на экран:
# "Khal Drogo's favorite word is "athjahakar""

print('"Khal Drogo\'s favorite word is "athjahakar""')

# Lesson 14
# Напишите программу, которая выводит на экран:
# - Did Joffrey agree?
# - He did. He also said "I love using \n".
# При этом программа использует только один print(),
# но результат на экране должен выглядеть в точности, как показано выше.

print('- Did Joffrey agree?\n- He did. He also said "I love using \\n".')

# Lesson 15
# Выведите на экран
# Winter came for the House of Frey.
# используя конкатенацию слов.

print('Winter ' + 'came ' + 'for ' + 'the ' + 'House ' + 'of ' + 'Frey.')

# Lesson 16
# Воспользуйтесь таблицей кодов ASCII.
# Используя таблицу, выведите на экран
# (каждый на своей собственной строке) ~, ^ и %.

print(chr(126))
print(chr(94))
print(chr(37))