# Lesson 6
# Выведите на экран результат деления числа 81 на 9.

print(81 / 9)

# Lesson 7
# Напишите программу, которая посчитает разность между числами 6 и -81 и выведет ответ на экран.

print(6 - (-81))

# Lesson 8
# Напишите программу, которая считает и выводит на экран последовательно
# (по одному значению в каждой строчке)
# значения следующих математических выражений:
# «3 в степени 5» и «-8 разделить на -4».

print(3 ** 5)
print((-8) / (-4))

# Lesson 9
# Реализуйте программу, которая вычисляет и выводит на экран значение выражения:
# 8 / 2 + 5 - -3 / 2

print((8 / 2) + 5 - (-3) / 2)

# Lesson 10
# Дано вычисление 70 * 3 + 4 / 8 + 2.
# Расставьте скобки так, чтобы оба сложения (3 + 4) и (8 + 2)
# высчитывались в первую очередь. Выведите на экран результат.

print(70 * (3 + 4) / (8 + 2))