# Lesson 17
# Создайте переменную с именем motto и содержимым What Is Dead May Never Die!.
# Распечатайте содержимое переменной.

motto = 'What Is Dead May Never Die!'
print(motto)

# Lesson 18
# В упражнении определена переменная, внутри которой содержится строка.
# Переопределите значение этой переменной и присвойте ей строку,
# в которой расположите символы первоначальной строки в обратном порядке.

name = 'Brienna'
name = 'anneirB'
print(name)

# Lesson 19
# Создайте переменную, описывающую количество своих братьев, и присвойте ей значение 2.
# Распечатайте содержимое переменной. Затем сравните свое имя с именем, которое используется в учительском решении.

my_brothers_count = 2
print(my_brothers_count)

# Lesson 20
# Найдите в программе необъявленную переменную и объявите ее, присвоив ей значение 'Dragon'.
# После выполнения программы результат на экране должен выглядеть так:
# Targaryen
#  and
# Dragon

family = 'Targaryen'
pet = 'Dragon'
print(family)
print(' and ')
print(pet)
